Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/MTMA_old/MTMA_old.tmx
Source language: en_us
Languages: de_de

source: The Ransomware Detection and Isolation module operatively associated with a cloud-based RMM platform according to claim 8,
de_de: Ransomware-Detektions- und Isolierungsmodul nach Anspruch 8, das operativ mit einer cloudbasierten RMM-Plattform verbunden ist,

source: wherein:
de_de: wobei:

source: the device is running a Windows OS, operating system, and the isolation script includes:
de_de: die Vorrichtung ein Windows-Betriebssystem ausführt und das Isolationsskript Folgendes beinhaltet:

source: using an OS registry to disable APIPA, Automatic Private IP Addressing, service to force the device to use the script provided information;
de_de: Verwenden einer Betriebssystemregistrierung, um einen APIPA(Automatic Private IP Addressing)-Dienst zu deaktivieren, um die Vorrichtung zu zwingen, die von dem Skript bereitgestellten Informationen zu verwenden;

source: disabling and stopping the OS LanManWorkstation service to disable the device from accessing mapped network drives;
de_de: Deaktivieren und Stoppen des Betriebssystemdienstes LanManWorkstation, um ein Zugreifen der Vorrichtung auf zugeordnete Netzwerklaufwerke zu deaktivieren;

source: using OS NetSH and NBTStat tools, clearing the ARP and NetBIOS caches from the device; and
de_de: Leeren der ARP- und NetBIOS-Caches der Vorrichtung unter Verwenden der Betriebssystemwerkzeuge NetSH und NBTStat; und

source: using NSPBind tool to disable IPv6 connectivity; or
de_de: Verwenden des NSPBind-Werkzeugs, um die IPv6-Konnektivität zu deaktivieren; oder

source: wherein the isolation script includes disabling IPv6 connectivity on the device and maintaining IPv4 connectivity; or
de_de: wobei das Isolationsskript Deaktivieren der IPv6-Konnektivität auf der Vorrichtung und Aufrechterhalten der IPv4-Konnektivität beinhaltet; oder

source: wherein the isolation script includes storing configuration associated with one or more of the device's active and inactive internet adapters in the OS registry to reestablish normal connectivity at a later time.
de_de: wobei das Isolationsskript Speichern einer Konfiguration, die mit einem oder mehreren der aktiven und inaktiven Internetadapter der Vorrichtung verbunden ist, in der Betriebssystemregistrierung beinhaltet, um zu einem späteren Zeitpunkt die normale Konnektivität wiederherzustellen.

source: The Ransomware Detection and Isolation module operatively associated with a cloud-based RMM platform according to claim 8, wherein:
de_de: Ransomware-Detektions- und Isolierungsmodul nach Anspruch 8, das operativ mit einer cloudbasierten RMM-Plattform verbunden ist, wobei:

source: the plurality of devices include one or more of a PC, Personal Computer, desktop computer, tablet PC, a set-top box, STB, a Personal Digital Assistant, PDA, a cellular telephone, a web appliance, a server, a network router, a switch or bridge, or any machine capable of executing a set of instructions sequential or otherwise – that specify actions to be taken by that machine; or
de_de: die Vielzahl von Vorrichtungen einen oder mehrere von Folgenden beinhaltet: einen Personal-Computer (PC), Desktop-Computer, Tablet-PC, eine Set-Top-Box (STB), einen Persönlichen Digitalen Assistenten (PDA), ein Mobiltelefon, eine Web-Appliance, einen Server, einen Netzwerk-Router, einen -Switch, eine -Brücke oder eine beliebige Maschine, die in der Lage ist, einen Satz von Anweisungen – sequentiell oder anderweitig – auszuführen, die Aktionen angeben, die von dieser Maschine zu unternehmen sind; oder

source: wherein the preset time-based schedule includes the scheduler generating timer events at a time interval of t, and t equals 1-20 seconds; or
de_de: wobei der voreingestellte zeitbasierte Zeitplan beinhaltet, dass der Scheduler Timer-Ereignisse in einem Zeitintervall von t erzeugt, wobei t 1–20 Sekunden gleichkommt; oder

source: wherein the RD module is implemented as a dll, dynamic link library, call function.
de_de: wobei das RD-Modul als DLL(Dynamic-Link-Library)-Aufruffunktion implementiert ist.

source: The Ransomware Detection Isolation module operatively associated with a cloud-based RMM platform according to claim 8,
de_de: Ransomware-Detektions-Isolierungsmodul nach Anspruch 8, das operativ mit einer cloudbasierten RMM-Plattform verbunden ist,

source: step b) further comprising the filewatcher handler ignoring each create, delete, update, and rename file-event included in the exclusion list.
de_de: Schritt b) ferner umfassend Ignorieren jedes in der Ausschlussliste aufgelisteten Erstell-, Lösch-, Aktualisierungs- und Umbenennungs-Dateiereignisses durch den Dateiwächter-Handler.

source: The RMM system operatively associated with monitoring and managing a plurality of devices according to claim 1, further comprising:
de_de: RMM-System nach Anspruch 1, das operativ mit Überwachen und Verwalten einer Vielzahl von Vorrichtungen verbunden ist, ferner umfassend:

source: e) if a RW-alert state is positive, the RD module performing a first remediation method to identify and kill a ransomware process associated with the RW-alert, the first remediation method including:
de_de: e) wenn ein RW-Warnungszustand positiv ist, Durchführen eines ersten Sanierungsverfahrens durch das RD-Modul, um einen mit der RW-Warnung verbundenen Ransomware-Vorgang zu identifizieren und abzubrechen, wobei das erste Sanierungsverfahren Folgendes beinhaltet:

source: e1) determining all running processes that were started prior to the detection time of a first encrypted file, and started less than a predetermined time before the detection time;
de_de: e1) Bestimmen aller laufenden Vorgänge, die vor dem Detektionszeitpunkt einer ersten verschlüsselten Datei gestartet wurden und weniger als einen vorbestimmten Zeitraum vor dem Detektionszeitpunkt gestartet wurden;

source: e2) of the determined running processes in step e1), determine the currently running process, not included in an exclusion process list, with a highest average accumulated kernel-CPU time and associated with a number of OS handles above a predetermined threshold; and
de_de: e2) Bestimmen des derzeit laufenden Vorgangs von den in Schritt e1) bestimmten laufenden Vorgängen, der nicht in einer Ausschlussvorgangsliste aufgelistet ist, mit der höchsten durchschnittlichen kumulierten Kernel-CPU-Zeit und mit dem eine Anzahl von Betriebssystem-Handles oberhalb eines vorbestimmten Schwellenwerts verbunden ist; und

source: e3) if step e2) and e3) result in an identification of a ransomware process, killing the ransomware process.
de_de: e3) Abbrechen des Ransomware-Vorgangs, falls die Schritte e2) und e3) in einer Identifizierung eines Ransomware-Vorgangs resultieren.

source: The RMM system operatively associated with monitoring and managing a plurality of devices according to claim 14, wherein, if a RW-alert state is positive, the RMM agent module performs a second remediation method to identify and kill a ransomware process associated with the RW-alert, the second remediation method including:
de_de: RMM-System nach Anspruch 14, das operativ mit Überwachen und Verwalten einer Vielzahl von Vorrichtungen verbunden ist, wobei das RMM-Agentenmodul, falls ein RW-Warnungszustand positiv ist, ein zweites Sanierungsverfahren durchführt, um einen mit der RW-Warnung verbundenen Ransomware-Vorgang zu identifizieren und abzubrechen, wobei das zweite Sanierungsverfahren Folgendes beinhaltet:

source: f1) determining all running processes on the local device which are not included in an exclusion process list;
de_de: f1) Bestimmen aller laufenden Vorgänge auf der lokalen Vorrichtung, die nicht in einer Ausschlussvorgangsliste beinhaltet sind;

source: f2) of the determined running processes in step f1), create a process performance counter for each determined running process, the process performance counters tracking I/O, Input/Output, write bytes per second for each process;
de_de: f2) Erstellen eines Vorgangsleistungszählers für jeden bestimmten laufenden Vorgang von den in Schritt f1) bestimmten laufenden Vorgängen, wobei die Vorgangsleistungszähler für jeden Vorgang die pro Sekunde geschriebenen I/O(Input/Output)-Bytes nachverfolgen;

source: f3) identifying one or more processes in step f2) with the highest relative counter values, indicating these processes include the most I/O intensive processes and are potential ransomware processes; and
de_de: f3) Identifizieren eines oder mehrerer Vorgänge in Schritt f2) mit den höchsten verhältnismäßigen Zählerwerten, wobei angezeigt wird, dass diese Vorgänge die I/O-intensivsten Vorgänge beinhalten und mögliche Ransomware-Vorgänge sind; und

source: f4) killing one or more of the processes identified in step f3).
de_de: f4) Abbrechen eines oder mehrerer der in Schritt f3) identifizierten Vorgänge.
